---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveParamSteelCantilever
source: html/fd034d6f-e57d-7e95-4801-a43bc57e40d9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveParamSteelCantilever Property

"Steel Cantilever"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveParamSteelCantilever { get; }
```